# Taps
# tap 'caskroom/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'zsh'

# Development
brew 'composer'
brew 'httpd', restart_service: true
# brew 'mariadb', restart_service: true (not currently using mariadb)
# brew 'mysql' (not using in favour of dbngin app)
brew 'nginx'
brew 'node'
brew 'openldap'
brew 'php'
brew 'php@8.0'
brew 'php@8.1'
brew 'redis'
brew 'webp'
# brew 'yarn' (prefer npm)

# Apps
cask '1password'
# cask 'adobe-creative-cloud' (not currently using)
# cask 'alt-tab' # https://alt-tab-macos.netlify.app/ (happy with stage manager instead)
cask 'appcleaner'
cask 'bartender'
# cask 'cleanmymac' (not currently using)
cask 'daisydisk'
cask 'dbngin'
cask 'discord'
cask 'docker'
# cask 'dropbox'
cask 'elgato-stream-deck'
cask 'firefox-developer-edition'
cask 'flux'
# cask 'forklift' (not currently using)
cask 'github'
# cask 'gitkraken' (no longer use. Use github desktop instead)
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'lofi' # A tiny Spotify player - https://www.lofi.rocks/
cask 'phpmon'
cask 'phpstorm'
cask 'postman'
cask 'hyper' # Electron-based, open source terminal https://hyper.is/
# cask 'skype' (no longer use, could be removed)
cask 'slack'
cask 'spotify'
cask 'tableplus'
# cask 'teamviewer' (not currently using)
# cask 'tower' (no longer use. Use github desktop instead)
# cask 'typeface' (not currently using)
cask 'ukelele' # (Unicode keyboard layout editor)
# cask 'visual-studio-code' (not currently using)
cask 'vlc'
# cask 'zoom' (not currently using)

# Mac App Store
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
mas 'Be Focused', id: 973134470
mas 'Coffee Buzz', id: 1099454186
mas 'ColorSlurp', id: 1287239339
mas 'CopyClip', id: 595191960
# mas 'CopyLess 2', id: 993841014 (not currently using)
# mas 'DaisyDisk', id: 411643860 (swapped for standalone version)
mas 'Dimensions', id: 822502888
# mas 'Fantastical 2', id: 975937182 (not currently using)
# mas 'Lightshot Screenshot', id: 526298438 (not currently using)
mas 'Magnet', id: 441258766
mas 'Pocket', id: 568494494
mas 'Quickshade', id: 931571202
mas 'Screenfloat', id: 414528154
# mas 'Screen Colors Filter', id: 1177401419 (not currently using)
mas 'Spark', id: 1176895641
mas 'Take a break', id: 1457158844
