# Taps
# tap 'homebrew/cask-versions'
tap 'nicoverbruggen/homebrew-cask' #(phpmon cask)

# Binaries
brew 'bash' # Latest Bash version
brew 'git'
# brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'zsh'

# Development
brew 'composer'
cask 'gpg-suite' # https://gpgtools.org/
# cask 'herd' (not currently using as unstable)
# brew 'httpd', restart_service: true (not using)
# brew 'mariadb', restart_service: true (not currently using mariadb)
# brew 'mysql' (not using in favour of dbngin app)
brew 'nginx'
brew 'node'
brew 'openldap'
brew 'php'
# brew 'redis'
brew 'webp'
# brew 'yarn' (prefer npm)

# 3D/CAD
cask 'autodesk-fusion360'
cask 'bambu-studio'
cask 'blender'
# cask 'freecad'
cask 'lycheeslicer'
# cask 'meshlab'
# cask 'orcaslicer'
# cask 'pronterface' (now using OctoPrint)
# cask 'prusaslicer'
# cask 'ultimaker-cura'

# VCS
# cask 'github' (switched back to Tower)
# cask 'gitkraken' (switched back to Tower)
cask 'tower'

# Music
# cask 'amazon-music'
# cask 'boom-3d'
cask 'lofi' # A tiny Spotify player - https://www.lofi.rocks/
cask 'spotify'
# cask 'tidal'

# Apps
cask '1password'
# cask 'adobe-creative-cloud' (not currently using)
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
# cask 'alt-tab' # https://alt-tab-macos.netlify.app/ (happy with stage manager instead)
cask 'appcleaner'
cask 'bartender'
# cask 'cleanmymac' (not currently using)
cask 'daisydisk'
cask 'dbngin'
cask 'discord'
# cask 'docker' (docker desktop is garbage)
# cask 'dropbox'
# cask 'firefox-developer-edition'
cask 'flux'
cask 'forklift'
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'phpmon'
# cask 'phpstorm' (install via jetbrains toolbox)
cask 'postman'
cask 'hyper' # Electron-based, open source terminal https://hyper.is/
cask 'screenflow'
# cask 'skype' (no longer use, could be removed)
cask 'slack'
cask 'surfshark'
cask 'tableplus'
# cask 'teamviewer'
# cask 'typeface' (not currently using)
# cask 'ukelele' # (Unicode keyboard layout editor)
# cask 'visual-studio-code' (not currently using)
cask 'via' # https://caniusevia.com/
cask 'vlc'
# cask 'zoom'

# Mac App Store
# mas 'Affinity Photo', id: 824183456 (swapped for standalone version)
# mas 'Affinity Designer', id: 824171161 (swapped for standalone version)
mas 'Amphetamine', id: 937984704
# mas 'Be Focused', id: 973134470
# mas 'Coffee Buzz', id: 1099454186
mas 'ColorSlurp', id: 1287239339
mas 'CopyClip', id: 595191960
# mas 'CopyLess 2', id: 993841014 (not currently using)
# mas 'DaisyDisk', id: 411643860 (swapped for standalone version)
# mas 'Dimensions', id: 822502888
mas 'Emma', id: 1270062373
# mas 'Fantastical 2', id: 975937182 (not currently using)
# mas 'Lightshot Screenshot', id: 526298438 (not currently using)
# mas 'Magnet', id: 441258766
mas 'Monday.com', id: 1298450641
mas 'Pocket', id: 568494494
# mas 'Quickshade', id: 931571202
# mas 'Reeder 5', id: 1529448980
mas 'Screenfloat', id: 414528154
# mas 'Screen Colors Filter', id: 1177401419 (not currently using)
# mas 'Spark', id: 1176895641
# mas 'Take a break', id: 1457158844
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp Messenger', id: 310633997
