# Taps
# tap 'caskroom/cask'
tap 'homebrew/cask-versions'

# Binaries
brew 'mas' # Mac App Store manager

# Development
brew 'node'
brew 'composer'
brew 'openldap'
brew 'git'
brew 'httpd', restart_service: true
# brew 'mariadb', restart_service: true (not currently using mariadb)
brew 'mysql', restart_service: true
brew 'webp'
brew 'php'
brew 'yarn'
brew 'sass/sass/sass'

# Apps
cask 'dropbox'
# cask 'github' (not currently using)
# cask 'skype' (no longer use, could be removed)
# cask 'slack' (not currently using)
cask 'tableplus'
# cask 'tower' (no longer use. Use gitkraken instead)
cask 'gitkraken'
# cask 'visual-studio-code' (not currently using)
cask 'phpstorm'
# cask '1password' (already installed)
cask 'google-chrome'
cask 'spotify'
cask 'discord'
cask 'firefox-developer-edition'
# cask 'cleanmymac' (not currently using)
cask 'vlc'
# cask 'teamviewer' (not currently using)
# cask 'forklift' (not currently using)
# cask 'typeface' (not currently using)
# cask 'flux' (not currently using)
cask 'adobe-creative-cloud'

# Mac App Store
mas 'Spark', id: 1176895641
# mas 'Affinity Photo', id: 824183456 (not currently using)
# mas 'Affinity Designer', id: 824171161 (not currently using)
# mas 'Be Focused', id: 973134470 (not currently using)
mas 'CopyLess 2', id: 993841014
mas 'Pocket', id: 568494494
# mas 'Fantastical 2', id: 975937182 (not currently using)
mas 'Lightshot Screenshot', id: 526298438
mas 'Screenfloat', id: 414528154
mas 'ColorSlurp', id: 1287239339
mas 'Take a break', id: 1457158844
mas 'Screen Colors Filter', id: 1177401419
