# Taps
# tap 'caskroom/cask'

# Binaries
brew 'mas' # Mac App Store manager

# Development
brew 'node'
brew 'composer'
brew 'openldap'
brew 'git'
brew 'httpd', restart_service: true
brew 'mariadb', restart_service: true
brew 'webp'
brew 'php'
brew 'yarn'
brew 'sass/sass/sass'

# Apps
cask 'dropbox'
cask 'github'
cask 'skype'
cask 'slack'
cask 'tableplus'
cask 'tower'
cask 'visual-studio-code'
cask '1password'
cask 'google-chrome'
cask 'spotify'
cask 'sip'
cask 'discord'

# Mac App Store
mas 'Spark', id: 1176895641
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
mas 'Be Focused', id: 973134470
mas 'CopyLess 2' id: 993841014
mas 'Pocket' id: 568494494
mas 'Fantastical 2' id: 975937182
mas 'Lightshot Screenshot' id: 526298438
mas 'Screenfloat' id: 414528154